{"contentType": "Chapter", "identifier": "doi:10.1007/12_2014_290", "url": [{"format": "", "platform": "", "value": "http://dx.doi.org/10.1007/12_2014_290"}], "title": "Shape Memory Polymer–Inorganic Hybrid Nanocomposites", "creators": [{"creator": "Reit, Radu"}, {"creator": "Lund, Benjamin"}, {"creator": "Voit, Walter"}], "publicationName": "Organic-Inorganic Hybrid Nanomaterials", "openaccess": "false", "doi": "10.1007/12_2014_290", "publisher": "Springer", "publicationDate": "2015-01-01", "publicationType": "Book", "printIsbn": "978-3-319-13592-2", "electronicIsbn": "978-3-319-13593-9", "isbn": "978-3-319-13592-2", "genre": "OriginalPaper", "copyright": "©2015 Springer International Publishing Switzerland", "abstract": "Shape memory polymers (SMPs) have been the focus of much research over the last few decades. From the novelty of temporarily fixing a three-dimensional shape from a planar polymer sheet, to the uses that SMPs are seeing today as softening biomedical implants and self-deploying hinges, this class of smart materials has successfully been used to tackle a variety of biological, electrical, and mechanical problems. However, the properties of these networks are limited by the organic nature of the SMPs. To enhance their properties, researchers across the globe have looked into imparting the desirable properties of inorganic composite materials to these polymer networks. As the field of shape memory polymer composites began to grow, researchers quantified the unique enhancements that came at varying filler loading levels as a result of controlled material interface interactions. Specifically, the incorporation of nanofillers of various shapes and sizes leads to increased internal interfacial area relative to micro- and macrocomposites at identical loading fractions and imparts interesting mechanical, optical, electrical, thermal, and magnetic properties to these emerging nanocomposites. This new class of material, referred to in this review as shape memory polymer–inorganic nanocomposites (SMPINCs), allows a host of new interactions between the smart polymer and its surrounding environment as a result of the ability to control the internal environment of the polymer network and nanofiller. In this work, the reader is introduced to both the methods of preparing these composites and the effects the fillers have on the biological, electromagnetic, and mechanical properties of the resulting composite."}